---
type: MEPSection
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 19
tags: [revit-api, class]
---

# MEPSection

`Autodesk.Revit.DB.Mechanical.MEPSection` · Revit 2024 · 19 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCoefficient | 2013 | `public double GetCoefficient ( ElementId elemId )` |
| Method | GetElementIds | 2013 | `public IList < ElementId > GetElementIds ()` |
| Method | GetPressureDrop | 2013 | `public double GetPressureDrop ( ElementId elemId )` |
| Method | GetSegmentLength | 2013 | `public double GetSegmentLength ( ElementId segmentId )` |
| Method | IsMain | 2013 | `public bool IsMain ( ElementId fittingId )` |
| Property | FixtureUnit | 2013 | `public double FixtureUnit { get ; }` |
| Property | Flow | 2013 | `public double Flow { get ; }` |
| Property | Friction | 2013 | `public double Friction { get ; }` |
| Property | FrictionFactor | 2013 | `public double FrictionFactor { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Number | 2013 | `public int Number { get ; }` |
| Property | ReynoldsNumber | 2013 | `public double ReynoldsNumber { get ; }` |
| Property | Roughness | 2013 | `public double Roughness { get ; }` |
| Property | TotalCoefficient | 2013 | `public double TotalCoefficient { get ; }` |
| Property | TotalCurveLength | 2013 | `public double TotalCurveLength { get ; }` |
| Property | TotalPressureLoss | 2013 | `public double TotalPressureLoss { get ; }` |
| Property | Velocity | 2013 | `public double Velocity { get ; }` |
| Property | VelocityPressure | 2013 | `public double VelocityPressure { get ; }` |